//####################################################################################################################### 
//# 
//# БИБЛИОТЕКА РАБОТЫ С КНОПКАМИ
//# 
//####################################################################################################################### 
  
#ifndef BUTTON_LIB_
#define BUTTON_LIB_


	//настройки параметров библиотеки 
	#define BTN_LOCK_TIME   20						/* время обработки дребезга в милисекундах (10-100) */ 
	#define BTN_LONG_TIME   300					/* время фиксации длинного нажатия в милисекундах (1000 - 2500) */ 
 
	//настройка портов и линий 
	#define BTN_PORT       PORTD					/* порт кнопок */ 
	#define BTN_PIN        PIND 
		//#define BTN_LINE1   	(1<<0)				/* линии кнопок */           
		#define BTN_LINE2   	(1<<1)                         
		//#define BTN_LINE3   	(1<<2)                         
		#define BTN_LINE4   	(1<<3)                         

	//определения флагов кнопок
	//#define BTN_SHRT1   	(1<<0)					/* флаги короткого нажатия кнопок */ 
	#define BTN_SHRT2   	(1<<1)  
	//#define BTN_SHRT3   	(1<<2) 
	#define BTN_SHRT4   	(1<<3) 
	//#define BTN_LONG1   	(1<<4)					/* флаги длинного нажатия кнопок */ 
	#define BTN_LONG2   	(1<<5) 
	//#define BTN_LONG3   	(1<<6) 
	//#define BTN_LONG4   	(1<<7) 
  

	//объявления функций
	void BtnInit (void);	//инициализация библиотеки 
	uint8_t BtnGet (void);	//функция чтения маски нажатой кнопки 
	void BtnExe (void);		//функция циклического опроса кнопок (вызывать с частотой 100Гц, например из прерывания) 

 
#endif /* BUTTON_LIB_ */

//####################################################################################################################### 
//# 
//# END
//# 
//####################################################################################################################### 
